espressif/esp-idf/components/soc/esp32p4/include/soc/mipi_dsi_bridge_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Registers */
/** Type of clk_en register
 *  dsi bridge clk control register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  this bit configures force_on of dsi_bridge register clock gate
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_brg_clk_en_reg_t;

/** Type of en register
 *  dsi bridge en register
 */
typedef union {
    struct {
        /** dsi_en : R/W; bitpos: [0]; default: 0;
         *  this bit configures module enable of dsi_bridge. 0: disable, 1: enable
         */
        uint32_t dsi_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_brg_en_reg_t;

/** Type of dma_req_cfg register
 *  dsi bridge dma burst len register
 */
typedef union {
    struct {
        /** dma_burst_len : R/W; bitpos: [11:0]; default: 128;
         *  this field configures the num of 64-bit in one dma burst transfer, valid only when
         *  dsi_bridge as flow controller
         */
        uint32_t dma_burst_len:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dsi_brg_dma_req_cfg_reg_t;

/** Type of raw_num_cfg register
 *  dsi bridge raw number control register
 */
typedef union {
    struct {
        /** raw_num_total : R/W; bitpos: [21:0]; default: 230400;
         *  this field configures number of total pix bits/64
         */
        uint32_t raw_num_total:22;
        /** unalign_64bit_en : R/W; bitpos: [22]; default: 0;
         *  this field configures whether the total pix bits is a multiple of 64bits. 0: align
         *  to 64-bit, 1: unalign to 64-bit
         */
        uint32_t unalign_64bit_en:1;
        uint32_t reserved_23:8;
        /** raw_num_total_set : WT; bitpos: [31]; default: 0;
         *  this bit configures enable of reload reg_raw_num_total to internal cnt. 0: disable,
         *  1: enable. valid only when dsi_bridge as flow controller
         */
        uint32_t raw_num_total_set:1;
    };
    uint32_t val;
} dsi_brg_raw_num_cfg_reg_t;

/** Type of raw_buf_credit_ctl register
 *  dsi bridge credit register
 */
typedef union {
    struct {
        /** credit_thrd : R/W; bitpos: [14:0]; default: 1024;
         *  this field configures the threshold whether dsi_bridge fifo can receive one more
         *  64-bit, valid only when dsi_bridge as flow controller
         */
        uint32_t credit_thrd:15;
        uint32_t reserved_15:1;
        /** credit_burst_thrd : R/W; bitpos: [30:16]; default: 800;
         *  this field configures the threshold whether dsi_bridge fifo can receive one more
         *  dma burst, valid only when dsi_bridge as flow controller
         */
        uint32_t credit_burst_thrd:15;
        /** credit_reset : R/W; bitpos: [31]; default: 0;
         *  this bit configures internal credit cnt clear, 0: non, 1: reset. valid only when
         *  dsi_bridge as flow controller
         */
        uint32_t credit_reset:1;
    };
    uint32_t val;
} dsi_brg_raw_buf_credit_ctl_reg_t;

/** Type of pixel_type register
 *  dsi bridge dpi type control register
 */
typedef union {
    struct {
        /** raw_type : R/W; bitpos: [3:0]; default: 0;
         *  this field configures the pixel type. 0: rgb888, 1:rgb666, 2:rgb565
         */
        uint32_t raw_type:4;
        /** dpi_config : R/W; bitpos: [5:4]; default: 0;
         *  this field configures the pixel arrange type of dpi interface
         */
        uint32_t dpi_config:2;
        /** data_in_type : R/W; bitpos: [6]; default: 0;
         *  input data type, 0: rgb, 1: yuv
         */
        uint32_t data_in_type:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} dsi_brg_pixel_type_reg_t;

/** Type of dma_block_interval register
 *  dsi bridge dma block interval control register
 */
typedef union {
    struct {
        /** dma_block_slot : R/W; bitpos: [9:0]; default: 9;
         *  this field configures the max block_slot_cnt
         */
        uint32_t dma_block_slot:10;
        /** dma_block_interval : R/W; bitpos: [27:10]; default: 9;
         *  this field configures the max block_interval_cnt, block_interval_cnt increased by 1
         *  when block_slot_cnt if full
         */
        uint32_t dma_block_interval:18;
        /** raw_num_total_auto_reload : R/W; bitpos: [28]; default: 1;
         *  this bit configures enable of auto reload reg_raw_num_total, 0: disable, 1: enable
         */
        uint32_t raw_num_total_auto_reload:1;
        /** dma_block_interval_en : R/W; bitpos: [29]; default: 1;
         *  this bit configures enable of interval between dma block transfer, 0: disable, 1:
         *  enable
         */
        uint32_t dma_block_interval_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} dsi_brg_dma_block_interval_reg_t;

/** Type of dma_req_interval register
 *  dsi bridge dma req interval control register
 */
typedef union {
    struct {
        /** dma_req_interval : R/W; bitpos: [15:0]; default: 1;
         *  this field configures the interval between dma req events
         */
        uint32_t dma_req_interval:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_brg_dma_req_interval_reg_t;

/** Type of dpi_lcd_ctl register
 *  dsi bridge dpi signal control register
 */
typedef union {
    struct {
        /** dpishutdn : R/W; bitpos: [0]; default: 0;
         *  this bit configures dpishutdn signal in dpi interface
         */
        uint32_t dpishutdn:1;
        /** dpicolorm : R/W; bitpos: [1]; default: 0;
         *  this bit configures dpicolorm signal in dpi interface
         */
        uint32_t dpicolorm:1;
        /** dpiupdatecfg : R/W; bitpos: [2]; default: 0;
         *  this bit configures dpiupdatecfg signal in dpi interface
         */
        uint32_t dpiupdatecfg:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dsi_brg_dpi_lcd_ctl_reg_t;

/** Type of dpi_rsv_dpi_data register
 *  dsi bridge dpi reserved data register
 */
typedef union {
    struct {
        /** dpi_rsv_data : R/W; bitpos: [29:0]; default: 16383;
         *  this field controls the pixel data sent to dsi_host when dsi_bridge fifo underflow
         */
        uint32_t dpi_rsv_data:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} dsi_brg_dpi_rsv_dpi_data_reg_t;

/** Type of dpi_v_cfg0 register
 *  dsi bridge dpi v config register 0
 */
typedef union {
    struct {
        /** vtotal : R/W; bitpos: [11:0]; default: 525;
         *  this field configures the total length of one frame (by line) for dpi output, must
         *  meet: reg_vtotal > reg_vdisp+reg_vsync+reg_vbank
         */
        uint32_t vtotal:12;
        uint32_t reserved_12:4;
        /** vdisp : R/W; bitpos: [27:16]; default: 480;
         *  this field configures the length of valid line (by line) for dpi output
         */
        uint32_t vdisp:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dsi_brg_dpi_v_cfg0_reg_t;

/** Type of dpi_v_cfg1 register
 *  dsi bridge dpi v config register 1
 */
typedef union {
    struct {
        /** vbank : R/W; bitpos: [11:0]; default: 33;
         *  this field configures the length between vsync and valid line (by line) for dpi
         *  output
         */
        uint32_t vbank:12;
        uint32_t reserved_12:4;
        /** vsync : R/W; bitpos: [27:16]; default: 2;
         *  this field configures the length of vsync (by line) for dpi output
         */
        uint32_t vsync:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dsi_brg_dpi_v_cfg1_reg_t;

/** Type of dpi_h_cfg0 register
 *  dsi bridge dpi h config register 0
 */
typedef union {
    struct {
        /** htotal : R/W; bitpos: [11:0]; default: 800;
         *  this field configures the total length of one line (by pixel num) for dpi output,
         *  must meet: reg_htotal > reg_hdisp+reg_hsync+reg_hbank
         */
        uint32_t htotal:12;
        uint32_t reserved_12:4;
        /** hdisp : R/W; bitpos: [27:16]; default: 640;
         *  this field configures the length of valid pixel data (by pixel num) for dpi output
         */
        uint32_t hdisp:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dsi_brg_dpi_h_cfg0_reg_t;

/** Type of dpi_h_cfg1 register
 *  dsi bridge dpi h config register 1
 */
typedef union {
    struct {
        /** hbank : R/W; bitpos: [11:0]; default: 48;
         *  this field configures the length between hsync and pixel data valid (by pixel num)
         *  for dpi output
         */
        uint32_t hbank:12;
        uint32_t reserved_12:4;
        /** hsync : R/W; bitpos: [27:16]; default: 96;
         *  this field configures the length of hsync (by pixel num) for dpi output
         */
        uint32_t hsync:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dsi_brg_dpi_h_cfg1_reg_t;

/** Type of dpi_misc_config register
 *  dsi_bridge dpi misc config register
 */
typedef union {
    struct {
        /** dpi_en : R/W; bitpos: [0]; default: 0;
         *  this bit configures enable of dpi output, 0: disable, 1: enable
         */
        uint32_t dpi_en:1;
        uint32_t reserved_1:3;
        /** fifo_underrun_discard_vcnt : R/W; bitpos: [15:4]; default: 413;
         *  this field configures the underrun interrupt musk, when underrun occurs and line
         *  cnt is less then this field
         */
        uint32_t fifo_underrun_discard_vcnt:12;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} dsi_brg_dpi_misc_config_reg_t;

/** Type of dpi_config_update register
 *  dsi_bridge dpi config update register
 */
typedef union {
    struct {
        /** dpi_config_update : WT; bitpos: [0]; default: 0;
         *  write 1 to this bit to update dpi config register MIPI_DSI_BRG_DPI_*
         */
        uint32_t dpi_config_update:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dsi_brg_dpi_config_update_reg_t;

/** Type of host_trigger_rev register
 *  dsi_bridge host trigger reverse control register
 */
typedef union {
    struct {
        /** tx_trigger_rev_en : R/W; bitpos: [0]; default: 0;
         *  tx_trigger reverse. 0: disable, 1: enable
         */
        uint32_t tx_trigger_rev_en:1;
        /** rx_trigger_rev_en : R/W; bitpos: [1]; default: 0;
         *  rx_trigger reverse. 0: disable, 1: enable
         */
        uint32_t rx_trigger_rev_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dsi_brg_host_trigger_rev_reg_t;

/** Type of blk_raw_num_cfg register
 *  dsi_bridge block raw number control register
 */
typedef union {
    struct {
        /** blk_raw_num_total : R/W; bitpos: [21:0]; default: 230400;
         *  this field configures number of total block pix bits/64
         */
        uint32_t blk_raw_num_total:22;
        uint32_t reserved_22:9;
        /** blk_raw_num_total_set : WT; bitpos: [31]; default: 0;
         *  write 1 to reload reg_blk_raw_num_total to internal cnt
         */
        uint32_t blk_raw_num_total_set:1;
    };
    uint32_t val;
} dsi_brg_blk_raw_num_cfg_reg_t;

